balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ96GA008.PIC
        <edc:SFRDef edc:access="nnn-----------nn" edc:cname="SPI2CON2" edc:desc="" edc:impl="0xe003" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----------00" edc:name="SPI2CON2" edc:nzwidth="0x10" edc:por="000-----------00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPIBEN" edc:desc="" edc:mask="0x1" edc:name="SPIBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPIFE" edc:desc="" edc:mask="0x1" edc:name="SPIFE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="11"/>
              <edc:SFRFieldDef edc:cname="SPIFPOL" edc:desc="" edc:mask="0x1" edc:name="SPIFPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPIFSD" edc:desc="" edc:mask="0x1" edc:name="SPIFSD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRMEN" edc:desc="" edc:mask="0x1" edc:name="FRMEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="SPI2BUF" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SPI2BUF" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI2BUF" edc:desc="" edc:mask="0xffff" edc:name="SPI2BUF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="86"/>
        <edc:SFRDef edc:access="nn---nn---------" edc:cname="TRISA" edc:desc="" edc:impl="0xc600" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11---11---------" edc:name="TRISA" edc:nzwidth="0x10" edc:por="11---11---------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="TRISA9" edc:desc="" edc:mask="0x1" edc:name="TRISA9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA10" edc:desc="" edc:mask="0x1" edc:name="TRISA10" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TRISA14" edc:desc="" edc:mask="0x1" edc:name="TRISA14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA15" edc:desc="" edc:mask="0x1" edc:name="TRISA15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISA" edc:desc="" edc:mask="0xffff" edc:name="TRISA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---nn---------" edc:cname="PORTA" edc:desc="" edc:impl="0xc600" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---00---------" edc:name="PORTA" edc:nzwidth="0x10" edc:por="00---00---------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="RA9" edc:desc="" edc:mask="0x1" edc:name="RA9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA10" edc:desc="" edc:mask="0x1" edc:name="RA10" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RA14" edc:desc="" edc:mask="0x1" edc:name="RA14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA15" edc:desc="" edc:mask="0x1" edc:name="RA15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RA" edc:desc="" edc:mask="0xffff" edc:name="RA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---nn---------" edc:cname="LATA" edc:desc="" edc:impl="0xc600" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---00---------" edc:name="LATA" edc:nzwidth="0x10" edc:por="00---00---------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="LATA9" edc:desc="" edc:mask="0x1" edc:name="LATA9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA10" edc:desc="" edc:mask="0x1" edc:name="LATA10" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LATA14" edc:desc="" edc:mask="0x1" edc:name="LATA14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA15" edc:desc="" edc:mask="0x1" edc:name="LATA15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATA" edc:desc="" edc:mask="0xffff" edc:name="LATA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TRISB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="TRISB" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB8" edc:desc="" edc:mask="0x1" edc:name="TRISB8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB9" edc:desc="" edc:mask="0x1" edc:name="TRISB9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB10" edc:desc="" edc:mask="0x1" edc:name="TRISB10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB11" edc:desc="" edc:mask="0x1" edc:name="TRISB11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB12" edc:desc="" edc:mask="0x1" edc:name="TRISB12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB13" edc:desc="" edc:mask="0x1" edc:name="TRISB13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB14" edc:desc="" edc:mask="0x1" edc:name="TRISB14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB15" edc:desc="" edc:mask="0x1" edc:name="TRISB15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISB" edc:desc="" edc:mask="0xffff" edc:name="TRISB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PORTB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="PORTB" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6" edc:desc="" edc:mask="0x1" edc:name="RB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB8" edc:desc="" edc:mask="0x1" edc:name="RB8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB9" edc:desc="" edc:mask="0x1" edc:name="RB9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB10" edc:desc="" edc:mask="0x1" edc:name="RB10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB11" edc:desc="" edc:mask="0x1" edc:name="RB11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB12" edc:desc="" edc:mask="0x1" edc:name="RB12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB13" edc:desc="" edc:mask="0x1" edc:name="RB13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB14" edc:desc="" edc:mask="0x1" edc:name="RB14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB15" edc:desc="" edc:mask="0x1" edc:name="RB15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RB" edc:desc="" edc:mask="0xffff" edc:name="RB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LATB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LATB" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB8" edc:desc="" edc:mask="0x1" edc:name="LATB8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB9" edc:desc="" edc:mask="0x1" edc:name="LATB9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB10" edc:desc="" edc:mask="0x1" edc:name="LATB10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB11" edc:desc="" edc:mask="0x1" edc:name="LATB11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB12" edc:desc="" edc:mask="0x1" edc:name="LATB12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB13" edc:desc="" edc:mask="0x1" edc:name="LATB13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB14" edc:desc="" edc:mask="0x1" edc:name="LATB14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB15" edc:desc="" edc:mask="0x1" edc:name="LATB15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATB" edc:desc="" edc:mask="0xffff" edc:name="LATB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--------n-n-" edc:cname="TRISC" edc:desc="" edc:impl="0xf00a" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111--------1-1-" edc:name="TRISC" edc:nzwidth="0x10" edc:por="1111--------1-1-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRISC1" edc:desc="" edc:mask="0x1" edc:name="TRISC1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRISC3" edc:desc="" edc:mask="0x1" edc:name="TRISC3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="TRISC12" edc:desc="" edc:mask="0x1" edc:name="TRISC12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC13" edc:desc="" edc:mask="0x1" edc:name="TRISC13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC14" edc:desc="" edc:mask="0x1" edc:name="TRISC14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC15" edc:desc="" edc:mask="0x1" edc:name="TRISC15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISC" edc:desc="" edc:mask="0xffff" edc:name="TRISC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--------n-n-" edc:cname="PORTC" edc:desc="" edc:impl="0xf00a" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu--------u-u-" edc:name="PORTC" edc:nzwidth="0x10" edc:por="xxxx--------x-x-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RC1" edc:desc="" edc:mask="0x1" edc:name="RC1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RC3" edc:desc="" edc:mask="0x1" edc:name="RC3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="RC12" edc:desc="" edc:mask="0x1" edc:name="RC12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC13" edc:desc="" edc:mask="0x1" edc:name="RC13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC14" edc:desc="" edc:mask="0x1" edc:name="RC14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC15" edc:desc="" edc:mask="0x1" edc:name="RC15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RC" edc:desc="" edc:mask="0xffff" edc:name="RC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--------n-n-" edc:cname="LATC" edc:desc="" edc:impl="0xf00a" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu--------u-u-" edc:name="LATC" edc:nzwidth="0x10" edc:por="0000--------0-0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LATC3" edc:desc="" edc:mask="0x1" edc:name="LATC3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="LATC12" edc:desc="" edc:mask="0x1" edc:name="LATC12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC13" edc:desc="" edc:mask="0x1" edc:name="LATC13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC14" edc:desc="" edc:mask="0x1" edc:name="LATC14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC15" edc:desc="" edc:mask="0x1" edc:name="LATC15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATC" edc:desc="" edc:mask="0xffff" edc:name="LATC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TRISD" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="TRISD" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISD0" edc:desc="" edc:mask="0x1" edc:name="TRISD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD1" edc:desc="" edc:mask="0x1" edc:name="TRISD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD2" edc:desc="" edc:mask="0x1" edc:name="TRISD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD3" edc:desc="" edc:mask="0x1" edc:name="TRISD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD4" edc:desc="" edc:mask="0x1" edc:name="TRISD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD5" edc:desc="" edc:mask="0x1" edc:name="TRISD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD6" edc:desc="" edc:mask="0x1" edc:name="TRISD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD7" edc:desc="" edc:mask="0x1" edc:name="TRISD7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD8" edc:desc="" edc:mask="0x1" edc:name="TRISD8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD9" edc:desc="" edc:mask="0x1" edc:name="TRISD9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD10" edc:desc="" edc:mask="0x1" edc:name="TRISD10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD11" edc:desc="" edc:mask="0x1" edc:name="TRISD11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD12" edc:desc="" edc:mask="0x1" edc:name="TRISD12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD13" edc:desc="" edc:mask="0x1" edc:name="TRISD13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD14" edc:desc="" edc:mask="0x1" edc:name="TRISD14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD15" edc:desc="" edc:mask="0x1" edc:name="TRISD15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISD" edc:desc="" edc:mask="0xffff" edc:name="TRISD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PORTD" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="PORTD" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD0" edc:desc="" edc:mask="0x1" edc:name="RD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1" edc:desc="" edc:mask="0x1" edc:name="RD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2" edc:desc="" edc:mask="0x1" edc:name="RD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3" edc:desc="" edc:mask="0x1" edc:name="RD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4" edc:desc="" edc:mask="0x1" edc:name="RD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5" edc:desc="" edc:mask="0x1" edc:name="RD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6" edc:desc="" edc:mask="0x1" edc:name="RD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7" edc:desc="" edc:mask="0x1" edc:name="RD7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD8" edc:desc="" edc:mask="0x1" edc:name="RD8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD9" edc:desc="" edc:mask="0x1" edc:name="RD9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD10" edc:desc="" edc:mask="0x1" edc:name="RD10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD11" edc:desc="" edc:mask="0x1" edc:name="RD11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD12" edc:desc="" edc:mask="0x1" edc:name="RD12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD13" edc:desc="" edc:mask="0x1" edc:name="RD13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD14" edc:desc="" edc:mask="0x1" edc:name="RD14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD15" edc:desc="" edc:mask="0x1" edc:name="RD15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:mask="0xffff" edc:name="RD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
