balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ96GA008.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCXOR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CRCXOR" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CRCXOR" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CRCXOR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="X1" edc:desc="" edc:mask="0x1" edc:name="X1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X2" edc:desc="" edc:mask="0x1" edc:name="X2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X3" edc:desc="" edc:mask="0x1" edc:name="X3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X4" edc:desc="" edc:mask="0x1" edc:name="X4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X5" edc:desc="" edc:mask="0x1" edc:name="X5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X6" edc:desc="" edc:mask="0x1" edc:name="X6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X7" edc:desc="" edc:mask="0x1" edc:name="X7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X8" edc:desc="" edc:mask="0x1" edc:name="X8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X9" edc:desc="" edc:mask="0x1" edc:name="X9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X10" edc:desc="" edc:mask="0x1" edc:name="X10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X11" edc:desc="" edc:mask="0x1" edc:name="X11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X12" edc:desc="" edc:mask="0x1" edc:name="X12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X13" edc:desc="" edc:mask="0x1" edc:name="X13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X14" edc:desc="" edc:mask="0x1" edc:name="X14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X15" edc:desc="" edc:mask="0x1" edc:name="X15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCDAT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CRCDAT" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CRCDAT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CRCDAT" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCWDAT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CRCWDAT" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CRCWDAT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CRCWDAT" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="120"/>
        <edc:SFRDef edc:access="nn---nn---------" edc:cname="ODCA" edc:desc="" edc:impl="0xc600" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---00---------" edc:name="ODCA" edc:nzwidth="0x10" edc:por="00---00---------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="ODA9" edc:desc="" edc:mask="0x1" edc:name="ODA9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODA10" edc:desc="" edc:mask="0x1" edc:name="ODA10" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ODA14" edc:desc="" edc:mask="0x1" edc:name="ODA14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODA15" edc:desc="" edc:mask="0x1" edc:name="ODA15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCA" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODCA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ODCB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ODCB" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODB0" edc:desc="" edc:mask="0x1" edc:name="ODB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB1" edc:desc="" edc:mask="0x1" edc:name="ODB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB2" edc:desc="" edc:mask="0x1" edc:name="ODB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB3" edc:desc="" edc:mask="0x1" edc:name="ODB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB4" edc:desc="" edc:mask="0x1" edc:name="ODB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB5" edc:desc="" edc:mask="0x1" edc:name="ODB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB6" edc:desc="" edc:mask="0x1" edc:name="ODB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB7" edc:desc="" edc:mask="0x1" edc:name="ODB7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB8" edc:desc="" edc:mask="0x1" edc:name="ODB8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB9" edc:desc="" edc:mask="0x1" edc:name="ODB9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB10" edc:desc="" edc:mask="0x1" edc:name="ODB10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB11" edc:desc="" edc:mask="0x1" edc:name="ODB11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB12" edc:desc="" edc:mask="0x1" edc:name="ODB12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB13" edc:desc="" edc:mask="0x1" edc:name="ODB13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB14" edc:desc="" edc:mask="0x1" edc:name="ODB14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB15" edc:desc="" edc:mask="0x1" edc:name="ODB15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCB" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODCB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="nnnn--------n-n-" edc:cname="ODCC" edc:desc="" edc:impl="0xf00a" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--------0-0-" edc:name="ODCC" edc:nzwidth="0x10" edc:por="0000--------0-0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ODC1" edc:desc="" edc:mask="0x1" edc:name="ODC1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ODC3" edc:desc="" edc:mask="0x1" edc:name="ODC3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="ODC12" edc:desc="" edc:mask="0x1" edc:name="ODC12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODC13" edc:desc="" edc:mask="0x1" edc:name="ODC13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODC14" edc:desc="" edc:mask="0x1" edc:name="ODC14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODC15" edc:desc="" edc:mask="0x1" edc:name="ODC15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCC" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODCC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ODCD" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ODCD" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODD0" edc:desc="" edc:mask="0x1" edc:name="ODD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD1" edc:desc="" edc:mask="0x1" edc:name="ODD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD2" edc:desc="" edc:mask="0x1" edc:name="ODD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD3" edc:desc="" edc:mask="0x1" edc:name="ODD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD4" edc:desc="" edc:mask="0x1" edc:name="ODD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD5" edc:desc="" edc:mask="0x1" edc:name="ODD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD6" edc:desc="" edc:mask="0x1" edc:name="ODD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD7" edc:desc="" edc:mask="0x1" edc:name="ODD7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD8" edc:desc="" edc:mask="0x1" edc:name="ODD8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD9" edc:desc="" edc:mask="0x1" edc:name="ODD9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD10" edc:desc="" edc:mask="0x1" edc:name="ODD10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD11" edc:desc="" edc:mask="0x1" edc:name="ODD11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD12" edc:desc="" edc:mask="0x1" edc:name="ODD12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD13" edc:desc="" edc:mask="0x1" edc:name="ODD13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD14" edc:desc="" edc:mask="0x1" edc:name="ODD14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODD15" edc:desc="" edc:mask="0x1" edc:name="ODD15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODCD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="ODCE" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ODCE" edc:nzwidth="0x10" edc:por="------0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODE0" edc:desc="" edc:mask="0x1" edc:name="ODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE1" edc:desc="" edc:mask="0x1" edc:name="ODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE2" edc:desc="" edc:mask="0x1" edc:name="ODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE3" edc:desc="" edc:mask="0x1" edc:name="ODE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE4" edc:desc="" edc:mask="0x1" edc:name="ODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE5" edc:desc="" edc:mask="0x1" edc:name="ODE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE6" edc:desc="" edc:mask="0x1" edc:name="ODE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE7" edc:desc="" edc:mask="0x1" edc:name="ODE7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE8" edc:desc="" edc:mask="0x1" edc:name="ODE8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE9" edc:desc="" edc:mask="0x1" edc:name="ODE9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCE" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODCE" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="-------nnnnnnnnn" edc:cname="ODCF" edc:desc="" edc:impl="0x1ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000000000" edc:name="ODCF" edc:nzwidth="0x10" edc:por="-------000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODF0" edc:desc="" edc:mask="0x1" edc:name="ODF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF1" edc:desc="" edc:mask="0x1" edc:name="ODF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF2" edc:desc="" edc:mask="0x1" edc:name="ODF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF3" edc:desc="" edc:mask="0x1" edc:name="ODF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF4" edc:desc="" edc:mask="0x1" edc:name="ODF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF5" edc:desc="" edc:mask="0x1" edc:name="ODF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF6" edc:desc="" edc:mask="0x1" edc:name="ODF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF7" edc:desc="" edc:mask="0x1" edc:name="ODF7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF8" edc:desc="" edc:mask="0x1" edc:name="ODF8" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODCF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="n-----nnnn--nnnn" edc:cname="ODCG" edc:desc="" edc:impl="0x3cf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-----0000--0000" edc:name="ODCG" edc:nzwidth="0x10" edc:por="0-----0000--0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODG0" edc:desc="" edc:mask="0x1" edc:name="ODG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG1" edc:desc="" edc:mask="0x1" edc:name="ODG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG2" edc:desc="" edc:mask="0x1" edc:name="ODG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG3" edc:desc="" edc:mask="0x1" edc:name="ODG3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ODG6" edc:desc="" edc:mask="0x1" edc:name="ODG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG7" edc:desc="" edc:mask="0x1" edc:name="ODG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG8" edc:desc="" edc:mask="0x1" edc:name="ODG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG9" edc:desc="" edc:mask="0x1" edc:name="ODG9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="ODG15" edc:desc="" edc:mask="0x1" edc:name="ODG15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCG" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODCG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
